<!DOCTYPE html>
<html>
<body>
<h2>Investigacion: Cloud computing</h2>
<h3>Estudiantes:</h3>
<p>2019003973 - Eduardo Zumbado Granados</p>
<p>2019279722 - Jose Andr&eacute;s Rodr&iacute;guez Rojas</p>
<p>2019198812 - Josu&eacute; Quesada Solano</p>
<h3>Introduccion</h3>
<p>La siguiente investigaci&oacute;n pretende abarcar los conceptos y detalles m&aacute;s importantes del cloud computing, teniendo en
    cuenta tanto sus inicios y fundamentos como los logros que ha alcanzado en la actualidad y los servicios que se
    posibilitan gracias a esta herramienta. Ademas se analizaran los distintos modelos de cloud computing existentes y
    sus ventajas ante diferentes objetivos y p&uacute;blicos meta, de tal modo que se logre comprender con exactitud qu&eacute; modelo
    de servicio es necesario de utilizar a partir del an&aacute;lisis de quien necesita este servicio y los fines que se
    pretenden suplir a partir de su uso.</p>
<h3>Objetivos</h3>
<h4>Objetivo General</h4>
<p>Recolectar informaci&oacute;n sobre el Cloud Computing.</p>
<h4>Objetivos Espec&iacute;ficos</h4>
<p>Conocer qu&eacute; es el Cloud Computing y d&oacute;nde se origin&oacute;.</p>
<p>Describir conceptos b&aacute;sicos relacionados con el tema.</p>
<p>Diferenciar los diferentes modelos que ofrece el Cloud Computing.</p>
<p>Comparar los principales proveedores de este servicio.</p>

<h3>Descripcion del problema</h3>
<p>Est&aacute; investigacion pretende responder a las preguntas &iquest;que es el cloud computing? y &iquest;qu&eacute; tipos de servicios
    ofrece esta herramienta actualmente?, con el fin de determinar la importancia que tiene el cloud computing para
    la rama de la inform&aacute;tica y para los desarrolladores computacionales actuales.</p>

<h3>Marco teorico</h3>
<h4>Definici&oacute;n e historia de cloud computing</h4>
<p>La computaci&oacute;n en la nube o cloud computing corresponde a una estrategia que permite ofrecer servicios, tales como
    servidores, almacenamiento de datos, etc. a trav&eacute;s de internet, por lo que representa una opci&oacute;n para peque&ntilde;as,
    medianas y grandes empresas que requieran el uso de alguno de estos servicios y su accesibilidad continua.</p>
<p>Est&aacute; idea fue implementada (en una proporcion considerablemente grande) alrededor de 2006, principalmente por
    empresas de car&aacute;cter global, tales como Google (Google Cloud Services), Amazon Web Services y Microsoft (Microsoft
    Azure), sin embargo el fundamento de la computaci&oacute;n en la nube es un pensamiento que se atribuye a inform&aacute;ticos como
    Joseph Carl Robnett Licklider o John McCarthy, quienes, alrededor de 1960, fueron quienes iniciaron con esta
    corriente basados en el hecho de hacer que la web fuera un medio para trasmitir programas y datos a nivel
    global.</p>
<p>Pero, aunque empresas como Google, Amazon y Microsoft fueron quienes introdujeron el cloud computing a mayor escala,
    no fue ninguno de ellos quien logr&oacute; los primeros avances en este &aacute;mbito, sino una empresa estadounidense llamada
    Salesforce, quien en 1999 logr&oacute; el desarrollo de una p&aacute;gina web que ofrece aplicaciones empresariales a trav&eacute;s de
    internet.</p>
<p>Tras este hecho muchas otras empresas comenzaron a introducirse a la corriente del cloud computing, hasta llegar a
    la realidad actual de este tipo de computacion.
    El cloud computing ofrece diferentes modelos de servicio para satisfacer las necesidades de las empresas como lo son
    SaaS, PaaS y IaaS.</p>

<h4>Conceptos basicos</h4>
<p>Computaci&oacute;n: esta es la ciencia que se encarga de entender, mantener y desarrollar equipos computacionales como
    tambi&eacute;n de sus equipos perif&eacute;ricos. Tambi&eacute;n se encarga del funcionamiento de estos mediante operaciones matem&aacute;ticas
    que son la base de toda ciencia.</p>
<p>Nube: este es un concepto abstracto ya que se refiere a la conexi&oacute;n de m&uacute;ltiples servidores conectados mediante la
    red que funcionan para almacenar y administrar datos. Esto para facilitar el acceso a estos datos. En palabras m&aacute;s
    simples se podr&iacute;a decir que metaf&oacute;ricamente es como usar un almacenamiento en l&iacute;nea, en vez de usar el del
    computador.</p>
<p>Internet: es una red de conexiones entre computadores la cual permite la f&aacute;cil transferencia de informaci&oacute;n sin
    necesidad de que estas est&eacute;n conectadas entre s&iacute;.
    Servicios web: este concepto est&aacute; relacionado con el de internet, y se refiere al intercambio de informaci&oacute;n entre
    dos dispositivos mediante un puerto espec&iacute;fico, sirven para resolver problemas muy espec&iacute;ficos como por ejemplo en
    una aplicaci&oacute;n, un dispositivo hace una solicitud de informaci&oacute;n, el otro la recibe y responde enviando dicha
    informaci&oacute;n. Funciona con archivos como Json y HTML.</p>

<h4>Explicaci&oacute;n de los modelos de despliegue</h4>
<p> P&uacute;blica: En los modelos p&uacute;blicos los servicios son ofrecidos por empresas o proveedores que se encargan del
    mantenimiento y seguridad de los servicios ofrecidos. En este caso los usuarios no tienen necesidad de adquirir
    hardware, software o equipo de soporte, ya que este es gestionado por la empresa o proveedor.</p>
<p> Privada: Los modelos privados se caracterizan por ser utilizados por una sola organizaci&oacute;n, aunque pueden ser
    gestionados por terceros y pueden estar alojados tanto interna como externamente en la organizaci&oacute;n. Adem&aacute;s este
    tipo de modelos se caracterizan por no poseer puntos de acceso p&uacute;blico</p>
<p> H&iacute;brida: Se componen de dos infraestructuras distintas, ya que poseen una base del modelo privado pero aplican
    funcionalidades y caracter&iacute;sticas de un modelo p&uacute;blico.</p>

<h4>Explicaci&oacute;n de los modelos de servicio</h4>
<p> IaaS: El IaaS (Infrastructure as a Service) se caracteriza por proveer recursos inform&aacute;ticos, como
    servidores, redes, almacenamiento y espacio en centro de datos a las empresas que utilizan su un servicio
    con este modelo.</p>
<p>SaaS: Este modelo conocido como SaaS (Software as a Service) es trabajado en l&iacute;nea y no por la empresa. Esto
    permite que la empresa no tenga que preocuparse sobre mantenimiento de software, manejo de estructura,
    seguridad de red y dem&aacute;s servicios relacionados con mantener las aplicaciones en correcto funcionamiento. En
    el modelo SaaS se procura hacer m&aacute;s f&aacute;cil y c&oacute;modo el acceso a las aplicaciones y servicios ofrecidos a
    trav&eacute;s de una interfaz de navegador o de un programa.</p>
<p> PaaS: PaaS (Platform as a Service) es como una combinaci&oacute;n entre IaaS y SaaS, est&aacute; caracterizado por
    garantizar un entorno que provea todos los servicios y requisitos necesarios para dar soporte a la creaci&oacute;n
    y desarrollo de aplicaciones basadas en la web sin la necesidad de instalar IDEs ya que todo se desarrolla
    en l&iacute;nea.</p>

<h4>Comparativa de tres principales proveedores de Cloud Computing con respecto a su oferta general,
    posicionamiento en el mercado y beneficios para los developers:</h4>
<p> Amazon Web Services: es una colecci&oacute;n de servicios de computaci&oacute;n en la nube p&uacute;blica (tambi&eacute;n llamados
    servicios web) que en conjunto forman una plataforma de computaci&oacute;n en la nube, ofrecida por Amazon.com, es
    usado en aplicaciones populares como Dropbox, Foursquare, HootSuite. Es una de las ofertas internacionales
    m&aacute;s importantes de la computaci&oacute;n en la nube y compite directamente contra servicios como Microsoft Azure y
    Google Cloud Platform.</p>

<p>Microsoft Azure: es un servicio de computaci&oacute;n en la nube creado por Microsoft para construir, probar,
    desplegar y administrar aplicaciones y servicios mediante el uso de sus centros de datos. Proporciona
    software como servicio (SaaS), plataforma como servicio (PaaS) e infraestructura como servicio (IaaS) y es
    compatible con muchos lenguajes, herramientas y marcos de programaci&oacute;n diferentes, incluidos software y
    sistemas espec&iacute;ficos de Microsoft y de terceros.</p>

<p>Google Cloud: es una plataforma donde se encuentran las aplicaciones de desarrollo web que google ofrece.
    Esta nube ofrece servicios como lo son almacenamiento y an&aacute;lisis de datos, machine learning, etc. Adem&aacute;s
    esta provee los tres tipos de modelos de servicios (SaaS, PaaS, IaaS)</p>

<h3>Analisis de resultados</h3>
<p>A partir de los datos analizados es posible responder a las preguntas inicialmente planteadas, ya que, por
    una parte, se esclareci&oacute; el concepto y la explicaci&oacute;n del cloud computing, desde sus inicios, hasta lo que
    se conoce y se ha logrado desarrollar actualmente. Por otra parte se logr&oacute; conocer y descubrir las distintas
    modalidades y servicios que se ofrecen a trav&eacute;s del cloud computing, a usuarios de car&aacute;cter global, ya que
    estos servicios se adecuan a las necesidades tanto individuales, como es el caso de estudiantes y
    programadores independientes, como grupales y empresariales, como es el caso de grandes compa&ntilde;&iacute;as que
    tambi&eacute;n pueden utilizar estos servicios.</p>

<h3>Conclusiones</h3>
<p>Es notable como el cloud computing es un conjunto de servicios que posee un gran potencial y despliega una
    gran variedad de posibilidades a distintos p&uacute;blicos, ya que, como se analiz&oacute; anteriormente, sus escasos
    requisitos y sus variadas modalidades de servicio derivan en una herramienta muy vers&aacute;til a la hora de
    satisfacer las necesidades de clientes que van desde usuarios individuales hasta corporaciones
    multinacionales, por lo que es posible reconocer al cloud computing y sus diversos servicios como una
    herramienta fundamental y que es posible que se desenvuelva con mucha fuerza y con un gran alcance dentro de
    la computaci&oacute;n actual y futura.</p>

<h3>Recomendaciones</h3>
<p>En lo que se refiere a investigaci&oacute;n, es recomendable llevar un orden de los temas que se investigan, por
    ejemplo para este caso, primero se investig&oacute; el concepto de cloud computing, luego se procedi&oacute; con sus
    modelos de despliegue y finalmente con sus modelos de servicio. Esto para no confundir conceptos y as&iacute; tener
    un mejor entendimiento de todos los temas tocados.</p>
<p>En cuanto a recomendaciones sobre el cloud computing, esta es una herramienta muy &uacute;til que con el paso del
    tiempo ir&aacute; creciendo m&aacute;s, aumentando sus utilidades y tambi&eacute;n su eficiencia. Por lo que no es de extra&ntilde;ar
    que las empresas quieran utilizarla, pero &iquest;Qu&eacute; modelo utilizar?</p>

<p>Bueno esto depende de muchos factores, pero los que pueden ser de mayor peso son el tama&ntilde;o de la empresa como
    los gastos que esto implica para la empresa. Con esto en mente ya se puede decidir qu&eacute; modelo utilizar, en
    el caso de los de despliegue, digamos que es una empresa muy grande, entonces podr&iacute;a usar el modelo privado
    ya que este traer&aacute; ventajas como no tener acceso p&uacute;blico, y para el caso de los modelos de servicio dependen
    de lo que la empresa necesite, digamos que la empresa empezar&aacute; con un nuevo proyecto pero no posee los
    recursos necesarios para ello, aqu&iacute; el modelo m&aacute;s conveniente ser&aacute; el IaaS ya que este proveer&aacute; estos
    recursos a la empresa.</p>

<h3>Referencias bibliograficas</h3>
<p>Colaboradores de Wikipedia. (2020). Microsoft Azure. Recuperado 27 de julio de 2020, de
    https://es.wikipedia.org/wiki/Microsoft_Azure</p>
<p>Colaboradores de Wikipedia. (2020). Amazon Web Services. Recuperado 27 de julio de 2020, de
    https://es.wikipedia.org/wiki/Amazon_Web_Services</p>
<p>Colaboradores de Wikipedia. (2020). Computaci&oacute;n en la nube. Recuperado 27 de julio de 2020, de
    https://es.wikipedia.org/wiki/Computaci%C3%B3n_en_la_nube</p>
<p>IBM. (s. f.). &iquest;Qu&eacute; es cloud computing? Recuperado 27 de julio de 2020, de
    https://www.ibm.com/es-es/cloud/learn/cloud-computing-gbl</p>
<p>Salesforce. (s. f.). &iquest;Qu&eacute; es Cloud Computing? Recuperado 27 de julio de 2020, de
    https://www.salesforce.com/mx/cloud-computing/</p>
</body>
</html>
